app/views/users/show.html.erb

<p>My cards:
<p><% @user.cards.each do |card| %>
---
SELECT "cards".* FROM "cards" WHERE "cards"."user_id" = $1  [["user_id", 5]]