app/views/cards/index.html.erb


  <% current_user.cards.each do |card| %>
---
SELECT "cards".* FROM "cards" WHERE "cards"."user_id" = $1  [["user_id", 9]]