app/controllers/cards_controller.rb

SELECT "cards".* FROM "cards"
---
  def index
    @cards = @deck.cards.all

INSERT INTO "cards" ("original_text", "translated_text", "review_date", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["original_text", "c6"], ["translated_text", "t7"], ["review_date", Tue, 09 Aug 2016], ["created_at", 2016-08-06 06:11:58 UTC], ["updated_at", 2016-08-06 06:11:58 UTC], ["user_id", 1]]
---
  def create
    @card = @deck.cards.new(card_params)
    CardsMailer.pending_cards_notification(current_user).deliver_now
    @card.user_id = @deck.user_id
    @card.review_date = Date.today #+ 3.days
    if @card.save

UPDATE "cards" SET "translated_text" = $1, "review_date" = $2, "updated_at" = $3 WHERE "cards"."id" = $4  [["translated_text", "hhhh11"], ["review_date", Sat, 23 Jul 2016], ["updated_at", 2016-07-17 06:50:42 UTC], ["id", 14]]
---
  def update
    @card.update(card_params)

SELECT  "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
---
  def set_card
    @card = @deck.cards.find(params[:id])