app/controllers/home_controller.rb

  def check_answer
    @card = Card.find(params[:id])
    if Card.check_answer(@card, params[:answer])
      correct_answer(@card)
      @card.save
---
SELECT  "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 739], ["LIMIT", 1]]
UPDATE "cards" SET "review_date" = $1, "updated_at" = $2 WHERE "cards"."id" = $3  [["review_date", Fri, 29 Jul 2016], ["updated_at", 2016-07-23 14:07:25 UTC], ["id", 1148]]