app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("email", "created_at", "updated_at", "crypted_password", "salt") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def update
    @user = User.find(params[:id])
    @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "salt" = $1, "crypted_password" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["salt", "Yjsjr2SfnbscGWBUByh4"], ["crypted_password", "$2a$10$GnH.TXTzY/IBNqabXr85SOSSWJo5c6Ju/2.IL5u7Ouz3o2W6H87xq"], ["updated_at", 2016-08-01 13:36:40 UTC], ["id", 1]]